Центр_управления_производительностью_демо/src/Catalogs/Сценарии/Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сценарии</name>
  <predefined>
    <items>
      <name>Базовый</name>
      <description>Базовый</description>
    </items>
    <items>
      <name>Мониторинг</name>
      <description>Мониторинг</description>
    </items>
    <items>
      <name>Просмотр</name>
      <description>Просмотр</description>
    </items>
  </predefined>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальноеСостояние</name>
    <comment>Начальное состояние</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Структура</name>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СледующееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыСобытия</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыКоманды</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/CommonForms/ВыборСценария/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокСценариев();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарииПриАктивизацииСтроки(Элемент)
	
	Описание = Элемент.ТекущиеДанные.Описание;
	ОбновитьСостояниеЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработатьВыборСценария();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборСценария();
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Заполнить список доступных сценариев
//
Процедура ЗаполнитьСписокСценариев()
	
	Исключения = Новый Массив;
	Исключения.Добавить(Справочники.Сценарии.Базовый);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Исключения", Исключения);
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Сценарии.Ссылка,
		|	Сценарии.Наименование КАК Наименование,
		|	Сценарии.Описание
		|ИЗ
		|	Справочник.Сценарии КАК Сценарии
		|ГДЕ
		|	(НЕ Сценарии.Ссылка В (&Исключения))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сценарии.Предопределенный УБЫВ,
		|	Сценарии.Наименование";
	
	Сценарии.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьСписокСценариев()

&НаКлиенте
// Обновить состояние элементов управления
//
Процедура ОбновитьСостояниеЭлементовУправления()
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбрать.Доступность = 
		(Элементы.Сценарии.ТекущаяСтрока <> Неопределено);
	
КонецПроцедуры // ОбновитьСостояниеЭлементовУправления()

&НаКлиенте
Процедура ОбработатьВыборСценария()
	
	Сценарий = Элементы.Сценарии.ТекущиеДанные.Ссылка;
	ОповеститьОВыборе(Сценарий);
	
КонецПроцедуры
